#2* #Напишите программу для. проверки истинности утверждения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z 
# для всех значений предикат. Где Х,Y,Z = 0 и 1
xyz = ["000", "001", "010", "011", "100", "101", "111"]
for i in xyz:
    x = int(i[0])
    y = int(i[1])
    z = int(i[2])
    if not (x or y or z) == (not x and not y and not z):
        print(f'При {i} утверждение истино')